mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dfxg/common/s6e2dfxg.h
typedef struct stc_gdcsub_vram_sberraddr_s1_field
{
    union {
        struct {
            __IO  uint32_t  VRAM_SBERRADDR_S1    :32;
        };
        struct {
            __IO  uint32_t  VRAM_SBERRADDR_S10   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S11   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S12   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S13   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S14   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S15   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S16   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S17   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S18   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S19   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S110  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S111  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S112  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S113  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S114  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S115  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S116  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S117  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S118  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S119  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S120  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S121  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S122  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S123  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S124  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S125  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S126  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S127  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S128  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S129  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S130  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S131  :1;
        };
    };
} stc_gdcsub_vram_sberraddr_s1_field_t;

typedef struct stc_gdcsub_vram_arbiter_priority_field
{
    union {
        struct {
            __IO  uint32_t  VRAM_PRIORITY_S0_WRITE:2;
            __IO  uint32_t  VRAM_PRIORITY_S0_READ:2;
            __IO  uint32_t  VRAM_PRIORITY_S1_READ:2;
            __IO  uint32_t  VRAM_PRIORITY_S2_READ:2;
            __IO  uint32_t  RESERVED0            :24;
        };
        struct {
            __IO  uint32_t  VRAM_PRIORITY_S0_WRITE0:1;
            __IO  uint32_t  VRAM_PRIORITY_S0_WRITE1:1;
            __IO  uint32_t  VRAM_PRIORITY_S0_READ0:1;
            __IO  uint32_t  VRAM_PRIORITY_S0_READ1:1;
            __IO  uint32_t  VRAM_PRIORITY_S1_READ0:1;
            __IO  uint32_t  VRAM_PRIORITY_S1_READ1:1;
            __IO  uint32_t  VRAM_PRIORITY_S2_READ0:1;
            __IO  uint32_t  VRAM_PRIORITY_S2_READ1:1;
            __IO  uint32_t  RESERVED1            :24;
        };
    };
} stc_gdcsub_vram_arbiter_priority_field_t;

/*******************************************************************************
* GPIO_MODULE
*******************************************************************************/
typedef struct stc_gpio_pfr0_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  P8                       :1;
        __IO  uint32_t  P9                       :1;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  PB                       :1;
        __IO  uint32_t  PC                       :1;
        __IO  uint32_t  PD                       :1;
        __IO  uint32_t  PE                       :1;
        __IO  uint32_t  RESERVED0                :17;
} stc_gpio_pfr0_field_t;

typedef struct stc_gpio_pfr1_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  P8                       :1;
        __IO  uint32_t  P9                       :1;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  PB                       :1;
        __IO  uint32_t  PC                       :1;
        __IO  uint32_t  PD                       :1;
        __IO  uint32_t  PE                       :1;
        __IO  uint32_t  PF                       :1;
        __IO  uint32_t  RESERVED0                :16;
} stc_gpio_pfr1_field_t;

typedef struct stc_gpio_pfr2_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  RESERVED0                :24;
} stc_gpio_pfr2_field_t;

typedef struct stc_gpio_pfr3_field
{
        __IO  uint32_t  RESERVED0                :3;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  P8                       :1;
        __IO  uint32_t  P9                       :1;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  PB                       :1;
        __IO  uint32_t  PC                       :1;
        __IO  uint32_t  PD                       :1;
        __IO  uint32_t  PE                       :1;
        __IO  uint32_t  PF                       :1;
        __IO  uint32_t  RESERVED1                :16;
} stc_gpio_pfr3_field_t;

typedef struct stc_gpio_pfr4_field
{
        __IO  uint32_t  RESERVED0                :6;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  P8                       :1;
        __IO  uint32_t  P9                       :1;
        __IO  uint32_t  RESERVED1                :22;
} stc_gpio_pfr4_field_t;

typedef struct stc_gpio_pfr5_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  RESERVED0                :25;
} stc_gpio_pfr5_field_t;

