mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dfxg/common/s6e2dfxg.h
typedef struct stc_hsspi_wrcsdc4_field
{
    union {
        struct {
            __IO  uint16_t  DEC                  :1;
            __IO  uint16_t  TRP                  :2;
            __IO  uint16_t  CONT                 :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  WRCSDATA             :8;
        };
        struct {
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  TRP0                 :1;
            __IO  uint16_t  TRP1                 :1;
            __IO  uint16_t  RESERVED2            :5;
            __IO  uint16_t  WRCSDATA0            :1;
            __IO  uint16_t  WRCSDATA1            :1;
            __IO  uint16_t  WRCSDATA2            :1;
            __IO  uint16_t  WRCSDATA3            :1;
            __IO  uint16_t  WRCSDATA4            :1;
            __IO  uint16_t  WRCSDATA5            :1;
            __IO  uint16_t  WRCSDATA6            :1;
            __IO  uint16_t  WRCSDATA7            :1;
        };
    };
} stc_hsspi_wrcsdc4_field_t;

typedef struct stc_hsspi_wrcsdc5_field
{
    union {
        struct {
            __IO  uint16_t  DEC                  :1;
            __IO  uint16_t  TRP                  :2;
            __IO  uint16_t  CONT                 :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  WRCSDATA             :8;
        };
        struct {
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  TRP0                 :1;
            __IO  uint16_t  TRP1                 :1;
            __IO  uint16_t  RESERVED2            :5;
            __IO  uint16_t  WRCSDATA0            :1;
            __IO  uint16_t  WRCSDATA1            :1;
            __IO  uint16_t  WRCSDATA2            :1;
            __IO  uint16_t  WRCSDATA3            :1;
            __IO  uint16_t  WRCSDATA4            :1;
            __IO  uint16_t  WRCSDATA5            :1;
            __IO  uint16_t  WRCSDATA6            :1;
            __IO  uint16_t  WRCSDATA7            :1;
        };
    };
} stc_hsspi_wrcsdc5_field_t;

typedef struct stc_hsspi_wrcsdc6_field
{
    union {
        struct {
            __IO  uint16_t  DEC                  :1;
            __IO  uint16_t  TRP                  :2;
            __IO  uint16_t  CONT                 :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  WRCSDATA             :8;
        };
        struct {
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  TRP0                 :1;
            __IO  uint16_t  TRP1                 :1;
            __IO  uint16_t  RESERVED2            :5;
            __IO  uint16_t  WRCSDATA0            :1;
            __IO  uint16_t  WRCSDATA1            :1;
            __IO  uint16_t  WRCSDATA2            :1;
            __IO  uint16_t  WRCSDATA3            :1;
            __IO  uint16_t  WRCSDATA4            :1;
            __IO  uint16_t  WRCSDATA5            :1;
            __IO  uint16_t  WRCSDATA6            :1;
            __IO  uint16_t  WRCSDATA7            :1;
        };
    };
} stc_hsspi_wrcsdc6_field_t;

typedef struct stc_hsspi_wrcsdc7_field
{
    union {
        struct {
            __IO  uint16_t  DEC                  :1;
            __IO  uint16_t  TRP                  :2;
            __IO  uint16_t  CONT                 :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  WRCSDATA             :8;
        };
        struct {
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  TRP0                 :1;
            __IO  uint16_t  TRP1                 :1;
            __IO  uint16_t  RESERVED2            :5;
            __IO  uint16_t  WRCSDATA0            :1;
            __IO  uint16_t  WRCSDATA1            :1;
            __IO  uint16_t  WRCSDATA2            :1;
            __IO  uint16_t  WRCSDATA3            :1;
            __IO  uint16_t  WRCSDATA4            :1;
            __IO  uint16_t  WRCSDATA5            :1;
            __IO  uint16_t  WRCSDATA6            :1;
            __IO  uint16_t  WRCSDATA7            :1;
        };
    };
} stc_hsspi_wrcsdc7_field_t;

typedef struct stc_hsspi_mid_field
{
    union {
        struct {
            __IO  uint32_t  MID                  :32;
        };
        struct {
            __IO  uint32_t  MID0                 :1;
            __IO  uint32_t  MID1                 :1;
            __IO  uint32_t  MID2                 :1;
            __IO  uint32_t  MID3                 :1;
            __IO  uint32_t  MID4                 :1;
            __IO  uint32_t  MID5                 :1;
            __IO  uint32_t  MID6                 :1;
            __IO  uint32_t  MID7                 :1;
            __IO  uint32_t  MID8                 :1;
            __IO  uint32_t  MID9                 :1;
            __IO  uint32_t  MID10                :1;
            __IO  uint32_t  MID11                :1;
            __IO  uint32_t  MID12                :1;
            __IO  uint32_t  MID13                :1;
            __IO  uint32_t  MID14                :1;
            __IO  uint32_t  MID15                :1;
            __IO  uint32_t  MID16                :1;
            __IO  uint32_t  MID17                :1;
            __IO  uint32_t  MID18                :1;
            __IO  uint32_t  MID19                :1;
            __IO  uint32_t  MID20                :1;
            __IO  uint32_t  MID21                :1;
            __IO  uint32_t  MID22                :1;
            __IO  uint32_t  MID23                :1;
            __IO  uint32_t  MID24                :1;
            __IO  uint32_t  MID25                :1;
            __IO  uint32_t  MID26                :1;
            __IO  uint32_t  MID27                :1;
            __IO  uint32_t  MID28                :1;
            __IO  uint32_t  MID29                :1;
            __IO  uint32_t  MID30                :1;
            __IO  uint32_t  MID31                :1;
        };
    };
} stc_hsspi_mid_field_t;

typedef struct stc_hsspi_qdclkr_field
{
    union {
        struct {
            __IO   uint8_t  QHDIV                :4;
            __IO   uint8_t  RESERVED0            :4;
        };
        struct {
            __IO   uint8_t  QHDIV0               :1;
            __IO   uint8_t  QHDIV1               :1;
            __IO   uint8_t  QHDIV2               :1;
            __IO   uint8_t  QHDIV3               :1;
            __IO   uint8_t  RESERVED1            :4;
        };
    };
} stc_hsspi_qdclkr_field_t;

typedef struct stc_hsspi_dbcnt_field
{
        __IO   uint8_t  RXDBEN                   :1;
        __IO   uint8_t  TXDBEN                   :1;
        __IO   uint8_t  RESERVED0                :6;
} stc_hsspi_dbcnt_field_t;

