mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dfxg/common/s6e2dfxg.h
#define bFM_GPIO_PCR5_P0                          *((volatile  uint8_t *)(0x42DE2280UL))
#define bFM4_GPIO_PCR5_P0                         *((volatile  uint8_t *)(0x42DE2280UL))
#define bFM_GPIO_PCR5_P1                          *((volatile  uint8_t *)(0x42DE2284UL))
#define bFM4_GPIO_PCR5_P1                         *((volatile  uint8_t *)(0x42DE2284UL))
#define bFM_GPIO_PCR5_P2                          *((volatile  uint8_t *)(0x42DE2288UL))
#define bFM4_GPIO_PCR5_P2                         *((volatile  uint8_t *)(0x42DE2288UL))
#define bFM_GPIO_PCR5_P3                          *((volatile  uint8_t *)(0x42DE228CUL))
#define bFM4_GPIO_PCR5_P3                         *((volatile  uint8_t *)(0x42DE228CUL))
#define bFM_GPIO_PCR5_P4                          *((volatile  uint8_t *)(0x42DE2290UL))
#define bFM4_GPIO_PCR5_P4                         *((volatile  uint8_t *)(0x42DE2290UL))
#define bFM_GPIO_PCR5_P5                          *((volatile  uint8_t *)(0x42DE2294UL))
#define bFM4_GPIO_PCR5_P5                         *((volatile  uint8_t *)(0x42DE2294UL))
#define bFM_GPIO_PCR5_P6                          *((volatile  uint8_t *)(0x42DE2298UL))
#define bFM4_GPIO_PCR5_P6                         *((volatile  uint8_t *)(0x42DE2298UL))

#define bFM_GPIO_PCR6_P0                          *((volatile  uint8_t *)(0x42DE2300UL))
#define bFM4_GPIO_PCR6_P0                         *((volatile  uint8_t *)(0x42DE2300UL))
#define bFM_GPIO_PCR6_P1                          *((volatile  uint8_t *)(0x42DE2304UL))
#define bFM4_GPIO_PCR6_P1                         *((volatile  uint8_t *)(0x42DE2304UL))
#define bFM_GPIO_PCR6_P2                          *((volatile  uint8_t *)(0x42DE2308UL))
#define bFM4_GPIO_PCR6_P2                         *((volatile  uint8_t *)(0x42DE2308UL))
#define bFM_GPIO_PCR6_P3                          *((volatile  uint8_t *)(0x42DE230CUL))
#define bFM4_GPIO_PCR6_P3                         *((volatile  uint8_t *)(0x42DE230CUL))
#define bFM_GPIO_PCR6_P4                          *((volatile  uint8_t *)(0x42DE2310UL))
#define bFM4_GPIO_PCR6_P4                         *((volatile  uint8_t *)(0x42DE2310UL))
#define bFM_GPIO_PCR6_P5                          *((volatile  uint8_t *)(0x42DE2314UL))
#define bFM4_GPIO_PCR6_P5                         *((volatile  uint8_t *)(0x42DE2314UL))
#define bFM_GPIO_PCR6_P6                          *((volatile  uint8_t *)(0x42DE2318UL))
#define bFM4_GPIO_PCR6_P6                         *((volatile  uint8_t *)(0x42DE2318UL))
#define bFM_GPIO_PCR6_P7                          *((volatile  uint8_t *)(0x42DE231CUL))
#define bFM4_GPIO_PCR6_P7                         *((volatile  uint8_t *)(0x42DE231CUL))
#define bFM_GPIO_PCR6_P8                          *((volatile  uint8_t *)(0x42DE2320UL))
#define bFM4_GPIO_PCR6_P8                         *((volatile  uint8_t *)(0x42DE2320UL))

#define bFM_GPIO_PCR7_P0                          *((volatile  uint8_t *)(0x42DE2380UL))
#define bFM4_GPIO_PCR7_P0                         *((volatile  uint8_t *)(0x42DE2380UL))
#define bFM_GPIO_PCR7_P1                          *((volatile  uint8_t *)(0x42DE2384UL))
#define bFM4_GPIO_PCR7_P1                         *((volatile  uint8_t *)(0x42DE2384UL))
#define bFM_GPIO_PCR7_P2                          *((volatile  uint8_t *)(0x42DE2388UL))
#define bFM4_GPIO_PCR7_P2                         *((volatile  uint8_t *)(0x42DE2388UL))
#define bFM_GPIO_PCR7_P3                          *((volatile  uint8_t *)(0x42DE238CUL))
#define bFM4_GPIO_PCR7_P3                         *((volatile  uint8_t *)(0x42DE238CUL))
#define bFM_GPIO_PCR7_P4                          *((volatile  uint8_t *)(0x42DE2390UL))
#define bFM4_GPIO_PCR7_P4                         *((volatile  uint8_t *)(0x42DE2390UL))
#define bFM_GPIO_PCR7_P5                          *((volatile  uint8_t *)(0x42DE2394UL))
#define bFM4_GPIO_PCR7_P5                         *((volatile  uint8_t *)(0x42DE2394UL))
#define bFM_GPIO_PCR7_P6                          *((volatile  uint8_t *)(0x42DE2398UL))
#define bFM4_GPIO_PCR7_P6                         *((volatile  uint8_t *)(0x42DE2398UL))
#define bFM_GPIO_PCR7_P7                          *((volatile  uint8_t *)(0x42DE239CUL))
#define bFM4_GPIO_PCR7_P7                         *((volatile  uint8_t *)(0x42DE239CUL))
#define bFM_GPIO_PCR7_P8                          *((volatile  uint8_t *)(0x42DE23A0UL))
#define bFM4_GPIO_PCR7_P8                         *((volatile  uint8_t *)(0x42DE23A0UL))
#define bFM_GPIO_PCR7_P9                          *((volatile  uint8_t *)(0x42DE23A4UL))
#define bFM4_GPIO_PCR7_P9                         *((volatile  uint8_t *)(0x42DE23A4UL))
#define bFM_GPIO_PCR7_PA                          *((volatile  uint8_t *)(0x42DE23A8UL))
#define bFM4_GPIO_PCR7_PA                         *((volatile  uint8_t *)(0x42DE23A8UL))
#define bFM_GPIO_PCR7_PB                          *((volatile  uint8_t *)(0x42DE23ACUL))
#define bFM4_GPIO_PCR7_PB                         *((volatile  uint8_t *)(0x42DE23ACUL))
#define bFM_GPIO_PCR7_PC                          *((volatile  uint8_t *)(0x42DE23B0UL))
#define bFM4_GPIO_PCR7_PC                         *((volatile  uint8_t *)(0x42DE23B0UL))

#define bFM_GPIO_PCR9_P0                          *((volatile  uint8_t *)(0x42DE2480UL))
#define bFM4_GPIO_PCR9_P0                         *((volatile  uint8_t *)(0x42DE2480UL))
#define bFM_GPIO_PCR9_P1                          *((volatile  uint8_t *)(0x42DE2484UL))
#define bFM4_GPIO_PCR9_P1                         *((volatile  uint8_t *)(0x42DE2484UL))
#define bFM_GPIO_PCR9_P2                          *((volatile  uint8_t *)(0x42DE2488UL))
#define bFM4_GPIO_PCR9_P2                         *((volatile  uint8_t *)(0x42DE2488UL))
#define bFM_GPIO_PCR9_P3                          *((volatile  uint8_t *)(0x42DE248CUL))
#define bFM4_GPIO_PCR9_P3                         *((volatile  uint8_t *)(0x42DE248CUL))
#define bFM_GPIO_PCR9_P4                          *((volatile  uint8_t *)(0x42DE2490UL))
#define bFM4_GPIO_PCR9_P4                         *((volatile  uint8_t *)(0x42DE2490UL))
#define bFM_GPIO_PCR9_P5                          *((volatile  uint8_t *)(0x42DE2494UL))
#define bFM4_GPIO_PCR9_P5                         *((volatile  uint8_t *)(0x42DE2494UL))
#define bFM_GPIO_PCR9_P6                          *((volatile  uint8_t *)(0x42DE2498UL))
#define bFM4_GPIO_PCR9_P6                         *((volatile  uint8_t *)(0x42DE2498UL))
#define bFM_GPIO_PCR9_P7                          *((volatile  uint8_t *)(0x42DE249CUL))
#define bFM4_GPIO_PCR9_P7                         *((volatile  uint8_t *)(0x42DE249CUL))

#define bFM_GPIO_PCRE_P0                          *((volatile  uint8_t *)(0x42DE2700UL))
#define bFM4_GPIO_PCRE_P0                         *((volatile  uint8_t *)(0x42DE2700UL))
#define bFM_GPIO_PCRE_P2                          *((volatile  uint8_t *)(0x42DE2708UL))
#define bFM4_GPIO_PCRE_P2                         *((volatile  uint8_t *)(0x42DE2708UL))
#define bFM_GPIO_PCRE_P3                          *((volatile  uint8_t *)(0x42DE270CUL))
#define bFM4_GPIO_PCRE_P3                         *((volatile  uint8_t *)(0x42DE270CUL))

#define bFM_GPIO_PDIR0_P0                         *((volatile  uint8_t *)(0x42DE6000UL))
#define bFM4_GPIO_PDIR0_P0                        *((volatile  uint8_t *)(0x42DE6000UL))
#define bFM_GPIO_PDIR0_P1                         *((volatile  uint8_t *)(0x42DE6004UL))
#define bFM4_GPIO_PDIR0_P1                        *((volatile  uint8_t *)(0x42DE6004UL))
#define bFM_GPIO_PDIR0_P2                         *((volatile  uint8_t *)(0x42DE6008UL))
#define bFM4_GPIO_PDIR0_P2                        *((volatile  uint8_t *)(0x42DE6008UL))
#define bFM_GPIO_PDIR0_P3                         *((volatile  uint8_t *)(0x42DE600CUL))
#define bFM4_GPIO_PDIR0_P3                        *((volatile  uint8_t *)(0x42DE600CUL))
#define bFM_GPIO_PDIR0_P4                         *((volatile  uint8_t *)(0x42DE6010UL))
#define bFM4_GPIO_PDIR0_P4                        *((volatile  uint8_t *)(0x42DE6010UL))
#define bFM_GPIO_PDIR0_P5                         *((volatile  uint8_t *)(0x42DE6014UL))
#define bFM4_GPIO_PDIR0_P5                        *((volatile  uint8_t *)(0x42DE6014UL))
#define bFM_GPIO_PDIR0_P6                         *((volatile  uint8_t *)(0x42DE6018UL))
#define bFM4_GPIO_PDIR0_P6                        *((volatile  uint8_t *)(0x42DE6018UL))
#define bFM_GPIO_PDIR0_P7                         *((volatile  uint8_t *)(0x42DE601CUL))
#define bFM4_GPIO_PDIR0_P7                        *((volatile  uint8_t *)(0x42DE601CUL))
#define bFM_GPIO_PDIR0_P8                         *((volatile  uint8_t *)(0x42DE6020UL))
#define bFM4_GPIO_PDIR0_P8                        *((volatile  uint8_t *)(0x42DE6020UL))
#define bFM_GPIO_PDIR0_P9                         *((volatile  uint8_t *)(0x42DE6024UL))
#define bFM4_GPIO_PDIR0_P9                        *((volatile  uint8_t *)(0x42DE6024UL))
#define bFM_GPIO_PDIR0_PA                         *((volatile  uint8_t *)(0x42DE6028UL))
#define bFM4_GPIO_PDIR0_PA                        *((volatile  uint8_t *)(0x42DE6028UL))
#define bFM_GPIO_PDIR0_PB                         *((volatile  uint8_t *)(0x42DE602CUL))
#define bFM4_GPIO_PDIR0_PB                        *((volatile  uint8_t *)(0x42DE602CUL))
#define bFM_GPIO_PDIR0_PC                         *((volatile  uint8_t *)(0x42DE6030UL))
#define bFM4_GPIO_PDIR0_PC                        *((volatile  uint8_t *)(0x42DE6030UL))
#define bFM_GPIO_PDIR0_PD                         *((volatile  uint8_t *)(0x42DE6034UL))
#define bFM4_GPIO_PDIR0_PD                        *((volatile  uint8_t *)(0x42DE6034UL))
#define bFM_GPIO_PDIR0_PE                         *((volatile  uint8_t *)(0x42DE6038UL))
#define bFM4_GPIO_PDIR0_PE                        *((volatile  uint8_t *)(0x42DE6038UL))

#define bFM_GPIO_PDIR1_P0                         *((volatile  uint8_t *)(0x42DE6080UL))
#define bFM4_GPIO_PDIR1_P0                        *((volatile  uint8_t *)(0x42DE6080UL))
#define bFM_GPIO_PDIR1_P1                         *((volatile  uint8_t *)(0x42DE6084UL))
#define bFM4_GPIO_PDIR1_P1                        *((volatile  uint8_t *)(0x42DE6084UL))
#define bFM_GPIO_PDIR1_P2                         *((volatile  uint8_t *)(0x42DE6088UL))
#define bFM4_GPIO_PDIR1_P2                        *((volatile  uint8_t *)(0x42DE6088UL))
#define bFM_GPIO_PDIR1_P3                         *((volatile  uint8_t *)(0x42DE608CUL))
#define bFM4_GPIO_PDIR1_P3                        *((volatile  uint8_t *)(0x42DE608CUL))
#define bFM_GPIO_PDIR1_P4                         *((volatile  uint8_t *)(0x42DE6090UL))
#define bFM4_GPIO_PDIR1_P4                        *((volatile  uint8_t *)(0x42DE6090UL))
#define bFM_GPIO_PDIR1_P5                         *((volatile  uint8_t *)(0x42DE6094UL))
#define bFM4_GPIO_PDIR1_P5                        *((volatile  uint8_t *)(0x42DE6094UL))
#define bFM_GPIO_PDIR1_P6                         *((volatile  uint8_t *)(0x42DE6098UL))
#define bFM4_GPIO_PDIR1_P6                        *((volatile  uint8_t *)(0x42DE6098UL))
#define bFM_GPIO_PDIR1_P7                         *((volatile  uint8_t *)(0x42DE609CUL))
#define bFM4_GPIO_PDIR1_P7                        *((volatile  uint8_t *)(0x42DE609CUL))
#define bFM_GPIO_PDIR1_P8                         *((volatile  uint8_t *)(0x42DE60A0UL))
#define bFM4_GPIO_PDIR1_P8                        *((volatile  uint8_t *)(0x42DE60A0UL))
#define bFM_GPIO_PDIR1_P9                         *((volatile  uint8_t *)(0x42DE60A4UL))
#define bFM4_GPIO_PDIR1_P9                        *((volatile  uint8_t *)(0x42DE60A4UL))
#define bFM_GPIO_PDIR1_PA                         *((volatile  uint8_t *)(0x42DE60A8UL))
#define bFM4_GPIO_PDIR1_PA                        *((volatile  uint8_t *)(0x42DE60A8UL))
#define bFM_GPIO_PDIR1_PB                         *((volatile  uint8_t *)(0x42DE60ACUL))
#define bFM4_GPIO_PDIR1_PB                        *((volatile  uint8_t *)(0x42DE60ACUL))
#define bFM_GPIO_PDIR1_PC                         *((volatile  uint8_t *)(0x42DE60B0UL))
#define bFM4_GPIO_PDIR1_PC                        *((volatile  uint8_t *)(0x42DE60B0UL))
#define bFM_GPIO_PDIR1_PD                         *((volatile  uint8_t *)(0x42DE60B4UL))
#define bFM4_GPIO_PDIR1_PD                        *((volatile  uint8_t *)(0x42DE60B4UL))
#define bFM_GPIO_PDIR1_PE                         *((volatile  uint8_t *)(0x42DE60B8UL))
#define bFM4_GPIO_PDIR1_PE                        *((volatile  uint8_t *)(0x42DE60B8UL))
#define bFM_GPIO_PDIR1_PF                         *((volatile  uint8_t *)(0x42DE60BCUL))
#define bFM4_GPIO_PDIR1_PF                        *((volatile  uint8_t *)(0x42DE60BCUL))

#define bFM_GPIO_PDIR2_P0                         *((volatile  uint8_t *)(0x42DE6100UL))
#define bFM4_GPIO_PDIR2_P0                        *((volatile  uint8_t *)(0x42DE6100UL))
#define bFM_GPIO_PDIR2_P1                         *((volatile  uint8_t *)(0x42DE6104UL))
#define bFM4_GPIO_PDIR2_P1                        *((volatile  uint8_t *)(0x42DE6104UL))
#define bFM_GPIO_PDIR2_P2                         *((volatile  uint8_t *)(0x42DE6108UL))
#define bFM4_GPIO_PDIR2_P2                        *((volatile  uint8_t *)(0x42DE6108UL))
#define bFM_GPIO_PDIR2_P3                         *((volatile  uint8_t *)(0x42DE610CUL))
#define bFM4_GPIO_PDIR2_P3                        *((volatile  uint8_t *)(0x42DE610CUL))
#define bFM_GPIO_PDIR2_P4                         *((volatile  uint8_t *)(0x42DE6110UL))
#define bFM4_GPIO_PDIR2_P4                        *((volatile  uint8_t *)(0x42DE6110UL))
#define bFM_GPIO_PDIR2_P5                         *((volatile  uint8_t *)(0x42DE6114UL))
#define bFM4_GPIO_PDIR2_P5                        *((volatile  uint8_t *)(0x42DE6114UL))
#define bFM_GPIO_PDIR2_P6                         *((volatile  uint8_t *)(0x42DE6118UL))
#define bFM4_GPIO_PDIR2_P6                        *((volatile  uint8_t *)(0x42DE6118UL))
#define bFM_GPIO_PDIR2_P7                         *((volatile  uint8_t *)(0x42DE611CUL))
#define bFM4_GPIO_PDIR2_P7                        *((volatile  uint8_t *)(0x42DE611CUL))

#define bFM_GPIO_PDIR3_P3                         *((volatile  uint8_t *)(0x42DE618CUL))
#define bFM4_GPIO_PDIR3_P3                        *((volatile  uint8_t *)(0x42DE618CUL))
#define bFM_GPIO_PDIR3_P4                         *((volatile  uint8_t *)(0x42DE6190UL))
#define bFM4_GPIO_PDIR3_P4                        *((volatile  uint8_t *)(0x42DE6190UL))
#define bFM_GPIO_PDIR3_P5                         *((volatile  uint8_t *)(0x42DE6194UL))
#define bFM4_GPIO_PDIR3_P5                        *((volatile  uint8_t *)(0x42DE6194UL))
#define bFM_GPIO_PDIR3_P6                         *((volatile  uint8_t *)(0x42DE6198UL))
#define bFM4_GPIO_PDIR3_P6                        *((volatile  uint8_t *)(0x42DE6198UL))
#define bFM_GPIO_PDIR3_P7                         *((volatile  uint8_t *)(0x42DE619CUL))
#define bFM4_GPIO_PDIR3_P7                        *((volatile  uint8_t *)(0x42DE619CUL))
#define bFM_GPIO_PDIR3_P8                         *((volatile  uint8_t *)(0x42DE61A0UL))
#define bFM4_GPIO_PDIR3_P8                        *((volatile  uint8_t *)(0x42DE61A0UL))
#define bFM_GPIO_PDIR3_P9                         *((volatile  uint8_t *)(0x42DE61A4UL))
#define bFM4_GPIO_PDIR3_P9                        *((volatile  uint8_t *)(0x42DE61A4UL))
#define bFM_GPIO_PDIR3_PA                         *((volatile  uint8_t *)(0x42DE61A8UL))
#define bFM4_GPIO_PDIR3_PA                        *((volatile  uint8_t *)(0x42DE61A8UL))
#define bFM_GPIO_PDIR3_PB                         *((volatile  uint8_t *)(0x42DE61ACUL))
#define bFM4_GPIO_PDIR3_PB                        *((volatile  uint8_t *)(0x42DE61ACUL))
#define bFM_GPIO_PDIR3_PC                         *((volatile  uint8_t *)(0x42DE61B0UL))
#define bFM4_GPIO_PDIR3_PC                        *((volatile  uint8_t *)(0x42DE61B0UL))
#define bFM_GPIO_PDIR3_PD                         *((volatile  uint8_t *)(0x42DE61B4UL))
#define bFM4_GPIO_PDIR3_PD                        *((volatile  uint8_t *)(0x42DE61B4UL))
#define bFM_GPIO_PDIR3_PE                         *((volatile  uint8_t *)(0x42DE61B8UL))
#define bFM4_GPIO_PDIR3_PE                        *((volatile  uint8_t *)(0x42DE61B8UL))
#define bFM_GPIO_PDIR3_PF                         *((volatile  uint8_t *)(0x42DE61BCUL))
#define bFM4_GPIO_PDIR3_PF                        *((volatile  uint8_t *)(0x42DE61BCUL))

#define bFM_GPIO_PDIR4_P6                         *((volatile  uint8_t *)(0x42DE6218UL))
#define bFM4_GPIO_PDIR4_P6                        *((volatile  uint8_t *)(0x42DE6218UL))
#define bFM_GPIO_PDIR4_P7                         *((volatile  uint8_t *)(0x42DE621CUL))
#define bFM4_GPIO_PDIR4_P7                        *((volatile  uint8_t *)(0x42DE621CUL))
#define bFM_GPIO_PDIR4_P8                         *((volatile  uint8_t *)(0x42DE6220UL))
#define bFM4_GPIO_PDIR4_P8                        *((volatile  uint8_t *)(0x42DE6220UL))
#define bFM_GPIO_PDIR4_P9                         *((volatile  uint8_t *)(0x42DE6224UL))
#define bFM4_GPIO_PDIR4_P9                        *((volatile  uint8_t *)(0x42DE6224UL))

