mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dfxg/common/s6e2dfxg.h
#define bFM_GPIO_PDIR5_P0                         *((volatile  uint8_t *)(0x42DE6280UL))
#define bFM4_GPIO_PDIR5_P0                        *((volatile  uint8_t *)(0x42DE6280UL))
#define bFM_GPIO_PDIR5_P1                         *((volatile  uint8_t *)(0x42DE6284UL))
#define bFM4_GPIO_PDIR5_P1                        *((volatile  uint8_t *)(0x42DE6284UL))
#define bFM_GPIO_PDIR5_P2                         *((volatile  uint8_t *)(0x42DE6288UL))
#define bFM4_GPIO_PDIR5_P2                        *((volatile  uint8_t *)(0x42DE6288UL))
#define bFM_GPIO_PDIR5_P3                         *((volatile  uint8_t *)(0x42DE628CUL))
#define bFM4_GPIO_PDIR5_P3                        *((volatile  uint8_t *)(0x42DE628CUL))
#define bFM_GPIO_PDIR5_P4                         *((volatile  uint8_t *)(0x42DE6290UL))
#define bFM4_GPIO_PDIR5_P4                        *((volatile  uint8_t *)(0x42DE6290UL))
#define bFM_GPIO_PDIR5_P5                         *((volatile  uint8_t *)(0x42DE6294UL))
#define bFM4_GPIO_PDIR5_P5                        *((volatile  uint8_t *)(0x42DE6294UL))
#define bFM_GPIO_PDIR5_P6                         *((volatile  uint8_t *)(0x42DE6298UL))
#define bFM4_GPIO_PDIR5_P6                        *((volatile  uint8_t *)(0x42DE6298UL))

#define bFM_GPIO_PDIR6_P0                         *((volatile  uint8_t *)(0x42DE6300UL))
#define bFM4_GPIO_PDIR6_P0                        *((volatile  uint8_t *)(0x42DE6300UL))
#define bFM_GPIO_PDIR6_P1                         *((volatile  uint8_t *)(0x42DE6304UL))
#define bFM4_GPIO_PDIR6_P1                        *((volatile  uint8_t *)(0x42DE6304UL))
#define bFM_GPIO_PDIR6_P2                         *((volatile  uint8_t *)(0x42DE6308UL))
#define bFM4_GPIO_PDIR6_P2                        *((volatile  uint8_t *)(0x42DE6308UL))
#define bFM_GPIO_PDIR6_P3                         *((volatile  uint8_t *)(0x42DE630CUL))
#define bFM4_GPIO_PDIR6_P3                        *((volatile  uint8_t *)(0x42DE630CUL))
#define bFM_GPIO_PDIR6_P4                         *((volatile  uint8_t *)(0x42DE6310UL))
#define bFM4_GPIO_PDIR6_P4                        *((volatile  uint8_t *)(0x42DE6310UL))
#define bFM_GPIO_PDIR6_P5                         *((volatile  uint8_t *)(0x42DE6314UL))
#define bFM4_GPIO_PDIR6_P5                        *((volatile  uint8_t *)(0x42DE6314UL))
#define bFM_GPIO_PDIR6_P6                         *((volatile  uint8_t *)(0x42DE6318UL))
#define bFM4_GPIO_PDIR6_P6                        *((volatile  uint8_t *)(0x42DE6318UL))
#define bFM_GPIO_PDIR6_P7                         *((volatile  uint8_t *)(0x42DE631CUL))
#define bFM4_GPIO_PDIR6_P7                        *((volatile  uint8_t *)(0x42DE631CUL))
#define bFM_GPIO_PDIR6_P8                         *((volatile  uint8_t *)(0x42DE6320UL))
#define bFM4_GPIO_PDIR6_P8                        *((volatile  uint8_t *)(0x42DE6320UL))

#define bFM_GPIO_PDIR7_P0                         *((volatile  uint8_t *)(0x42DE6380UL))
#define bFM4_GPIO_PDIR7_P0                        *((volatile  uint8_t *)(0x42DE6380UL))
#define bFM_GPIO_PDIR7_P1                         *((volatile  uint8_t *)(0x42DE6384UL))
#define bFM4_GPIO_PDIR7_P1                        *((volatile  uint8_t *)(0x42DE6384UL))
#define bFM_GPIO_PDIR7_P2                         *((volatile  uint8_t *)(0x42DE6388UL))
#define bFM4_GPIO_PDIR7_P2                        *((volatile  uint8_t *)(0x42DE6388UL))
#define bFM_GPIO_PDIR7_P3                         *((volatile  uint8_t *)(0x42DE638CUL))
#define bFM4_GPIO_PDIR7_P3                        *((volatile  uint8_t *)(0x42DE638CUL))
#define bFM_GPIO_PDIR7_P4                         *((volatile  uint8_t *)(0x42DE6390UL))
#define bFM4_GPIO_PDIR7_P4                        *((volatile  uint8_t *)(0x42DE6390UL))
#define bFM_GPIO_PDIR7_P5                         *((volatile  uint8_t *)(0x42DE6394UL))
#define bFM4_GPIO_PDIR7_P5                        *((volatile  uint8_t *)(0x42DE6394UL))
#define bFM_GPIO_PDIR7_P6                         *((volatile  uint8_t *)(0x42DE6398UL))
#define bFM4_GPIO_PDIR7_P6                        *((volatile  uint8_t *)(0x42DE6398UL))
#define bFM_GPIO_PDIR7_P7                         *((volatile  uint8_t *)(0x42DE639CUL))
#define bFM4_GPIO_PDIR7_P7                        *((volatile  uint8_t *)(0x42DE639CUL))
#define bFM_GPIO_PDIR7_P8                         *((volatile  uint8_t *)(0x42DE63A0UL))
#define bFM4_GPIO_PDIR7_P8                        *((volatile  uint8_t *)(0x42DE63A0UL))
#define bFM_GPIO_PDIR7_P9                         *((volatile  uint8_t *)(0x42DE63A4UL))
#define bFM4_GPIO_PDIR7_P9                        *((volatile  uint8_t *)(0x42DE63A4UL))
#define bFM_GPIO_PDIR7_PA                         *((volatile  uint8_t *)(0x42DE63A8UL))
#define bFM4_GPIO_PDIR7_PA                        *((volatile  uint8_t *)(0x42DE63A8UL))
#define bFM_GPIO_PDIR7_PB                         *((volatile  uint8_t *)(0x42DE63ACUL))
#define bFM4_GPIO_PDIR7_PB                        *((volatile  uint8_t *)(0x42DE63ACUL))
#define bFM_GPIO_PDIR7_PC                         *((volatile  uint8_t *)(0x42DE63B0UL))
#define bFM4_GPIO_PDIR7_PC                        *((volatile  uint8_t *)(0x42DE63B0UL))

#define bFM_GPIO_PDIR8_P0                         *((volatile  uint8_t *)(0x42DE6400UL))
#define bFM4_GPIO_PDIR8_P0                        *((volatile  uint8_t *)(0x42DE6400UL))
#define bFM_GPIO_PDIR8_P1                         *((volatile  uint8_t *)(0x42DE6404UL))
#define bFM4_GPIO_PDIR8_P1                        *((volatile  uint8_t *)(0x42DE6404UL))

#define bFM_GPIO_PDIR9_P0                         *((volatile  uint8_t *)(0x42DE6480UL))
#define bFM4_GPIO_PDIR9_P0                        *((volatile  uint8_t *)(0x42DE6480UL))
#define bFM_GPIO_PDIR9_P1                         *((volatile  uint8_t *)(0x42DE6484UL))
#define bFM4_GPIO_PDIR9_P1                        *((volatile  uint8_t *)(0x42DE6484UL))
#define bFM_GPIO_PDIR9_P2                         *((volatile  uint8_t *)(0x42DE6488UL))
#define bFM4_GPIO_PDIR9_P2                        *((volatile  uint8_t *)(0x42DE6488UL))
#define bFM_GPIO_PDIR9_P3                         *((volatile  uint8_t *)(0x42DE648CUL))
#define bFM4_GPIO_PDIR9_P3                        *((volatile  uint8_t *)(0x42DE648CUL))
#define bFM_GPIO_PDIR9_P4                         *((volatile  uint8_t *)(0x42DE6490UL))
#define bFM4_GPIO_PDIR9_P4                        *((volatile  uint8_t *)(0x42DE6490UL))
#define bFM_GPIO_PDIR9_P5                         *((volatile  uint8_t *)(0x42DE6494UL))
#define bFM4_GPIO_PDIR9_P5                        *((volatile  uint8_t *)(0x42DE6494UL))
#define bFM_GPIO_PDIR9_P6                         *((volatile  uint8_t *)(0x42DE6498UL))
#define bFM4_GPIO_PDIR9_P6                        *((volatile  uint8_t *)(0x42DE6498UL))
#define bFM_GPIO_PDIR9_P7                         *((volatile  uint8_t *)(0x42DE649CUL))
#define bFM4_GPIO_PDIR9_P7                        *((volatile  uint8_t *)(0x42DE649CUL))

#define bFM_GPIO_PDIRE_P0                         *((volatile  uint8_t *)(0x42DE6700UL))
#define bFM4_GPIO_PDIRE_P0                        *((volatile  uint8_t *)(0x42DE6700UL))
#define bFM_GPIO_PDIRE_P2                         *((volatile  uint8_t *)(0x42DE6708UL))
#define bFM4_GPIO_PDIRE_P2                        *((volatile  uint8_t *)(0x42DE6708UL))
#define bFM_GPIO_PDIRE_P3                         *((volatile  uint8_t *)(0x42DE670CUL))
#define bFM4_GPIO_PDIRE_P3                        *((volatile  uint8_t *)(0x42DE670CUL))

#define bFM_GPIO_PDOR0_P0                         *((volatile  uint8_t *)(0x42DE8000UL))
#define bFM4_GPIO_PDOR0_P0                        *((volatile  uint8_t *)(0x42DE8000UL))
#define bFM_GPIO_PDOR0_P1                         *((volatile  uint8_t *)(0x42DE8004UL))
#define bFM4_GPIO_PDOR0_P1                        *((volatile  uint8_t *)(0x42DE8004UL))
#define bFM_GPIO_PDOR0_P2                         *((volatile  uint8_t *)(0x42DE8008UL))
#define bFM4_GPIO_PDOR0_P2                        *((volatile  uint8_t *)(0x42DE8008UL))
#define bFM_GPIO_PDOR0_P3                         *((volatile  uint8_t *)(0x42DE800CUL))
#define bFM4_GPIO_PDOR0_P3                        *((volatile  uint8_t *)(0x42DE800CUL))
#define bFM_GPIO_PDOR0_P4                         *((volatile  uint8_t *)(0x42DE8010UL))
#define bFM4_GPIO_PDOR0_P4                        *((volatile  uint8_t *)(0x42DE8010UL))
#define bFM_GPIO_PDOR0_P5                         *((volatile  uint8_t *)(0x42DE8014UL))
#define bFM4_GPIO_PDOR0_P5                        *((volatile  uint8_t *)(0x42DE8014UL))
#define bFM_GPIO_PDOR0_P6                         *((volatile  uint8_t *)(0x42DE8018UL))
#define bFM4_GPIO_PDOR0_P6                        *((volatile  uint8_t *)(0x42DE8018UL))
#define bFM_GPIO_PDOR0_P7                         *((volatile  uint8_t *)(0x42DE801CUL))
#define bFM4_GPIO_PDOR0_P7                        *((volatile  uint8_t *)(0x42DE801CUL))
#define bFM_GPIO_PDOR0_P8                         *((volatile  uint8_t *)(0x42DE8020UL))
#define bFM4_GPIO_PDOR0_P8                        *((volatile  uint8_t *)(0x42DE8020UL))
#define bFM_GPIO_PDOR0_P9                         *((volatile  uint8_t *)(0x42DE8024UL))
#define bFM4_GPIO_PDOR0_P9                        *((volatile  uint8_t *)(0x42DE8024UL))
#define bFM_GPIO_PDOR0_PA                         *((volatile  uint8_t *)(0x42DE8028UL))
#define bFM4_GPIO_PDOR0_PA                        *((volatile  uint8_t *)(0x42DE8028UL))
#define bFM_GPIO_PDOR0_PB                         *((volatile  uint8_t *)(0x42DE802CUL))
#define bFM4_GPIO_PDOR0_PB                        *((volatile  uint8_t *)(0x42DE802CUL))
#define bFM_GPIO_PDOR0_PC                         *((volatile  uint8_t *)(0x42DE8030UL))
#define bFM4_GPIO_PDOR0_PC                        *((volatile  uint8_t *)(0x42DE8030UL))
#define bFM_GPIO_PDOR0_PD                         *((volatile  uint8_t *)(0x42DE8034UL))
#define bFM4_GPIO_PDOR0_PD                        *((volatile  uint8_t *)(0x42DE8034UL))
#define bFM_GPIO_PDOR0_PE                         *((volatile  uint8_t *)(0x42DE8038UL))
#define bFM4_GPIO_PDOR0_PE                        *((volatile  uint8_t *)(0x42DE8038UL))

#define bFM_GPIO_PDOR1_P0                         *((volatile  uint8_t *)(0x42DE8080UL))
#define bFM4_GPIO_PDOR1_P0                        *((volatile  uint8_t *)(0x42DE8080UL))
#define bFM_GPIO_PDOR1_P1                         *((volatile  uint8_t *)(0x42DE8084UL))
#define bFM4_GPIO_PDOR1_P1                        *((volatile  uint8_t *)(0x42DE8084UL))
#define bFM_GPIO_PDOR1_P2                         *((volatile  uint8_t *)(0x42DE8088UL))
#define bFM4_GPIO_PDOR1_P2                        *((volatile  uint8_t *)(0x42DE8088UL))
#define bFM_GPIO_PDOR1_P3                         *((volatile  uint8_t *)(0x42DE808CUL))
#define bFM4_GPIO_PDOR1_P3                        *((volatile  uint8_t *)(0x42DE808CUL))
#define bFM_GPIO_PDOR1_P4                         *((volatile  uint8_t *)(0x42DE8090UL))
#define bFM4_GPIO_PDOR1_P4                        *((volatile  uint8_t *)(0x42DE8090UL))
#define bFM_GPIO_PDOR1_P5                         *((volatile  uint8_t *)(0x42DE8094UL))
#define bFM4_GPIO_PDOR1_P5                        *((volatile  uint8_t *)(0x42DE8094UL))
#define bFM_GPIO_PDOR1_P6                         *((volatile  uint8_t *)(0x42DE8098UL))
#define bFM4_GPIO_PDOR1_P6                        *((volatile  uint8_t *)(0x42DE8098UL))
#define bFM_GPIO_PDOR1_P7                         *((volatile  uint8_t *)(0x42DE809CUL))
#define bFM4_GPIO_PDOR1_P7                        *((volatile  uint8_t *)(0x42DE809CUL))
#define bFM_GPIO_PDOR1_P8                         *((volatile  uint8_t *)(0x42DE80A0UL))
#define bFM4_GPIO_PDOR1_P8                        *((volatile  uint8_t *)(0x42DE80A0UL))
#define bFM_GPIO_PDOR1_P9                         *((volatile  uint8_t *)(0x42DE80A4UL))
#define bFM4_GPIO_PDOR1_P9                        *((volatile  uint8_t *)(0x42DE80A4UL))
#define bFM_GPIO_PDOR1_PA                         *((volatile  uint8_t *)(0x42DE80A8UL))
#define bFM4_GPIO_PDOR1_PA                        *((volatile  uint8_t *)(0x42DE80A8UL))
#define bFM_GPIO_PDOR1_PB                         *((volatile  uint8_t *)(0x42DE80ACUL))
#define bFM4_GPIO_PDOR1_PB                        *((volatile  uint8_t *)(0x42DE80ACUL))
#define bFM_GPIO_PDOR1_PC                         *((volatile  uint8_t *)(0x42DE80B0UL))
#define bFM4_GPIO_PDOR1_PC                        *((volatile  uint8_t *)(0x42DE80B0UL))
#define bFM_GPIO_PDOR1_PD                         *((volatile  uint8_t *)(0x42DE80B4UL))
#define bFM4_GPIO_PDOR1_PD                        *((volatile  uint8_t *)(0x42DE80B4UL))
#define bFM_GPIO_PDOR1_PE                         *((volatile  uint8_t *)(0x42DE80B8UL))
#define bFM4_GPIO_PDOR1_PE                        *((volatile  uint8_t *)(0x42DE80B8UL))
#define bFM_GPIO_PDOR1_PF                         *((volatile  uint8_t *)(0x42DE80BCUL))
#define bFM4_GPIO_PDOR1_PF                        *((volatile  uint8_t *)(0x42DE80BCUL))

#define bFM_GPIO_PDOR2_P0                         *((volatile  uint8_t *)(0x42DE8100UL))
#define bFM4_GPIO_PDOR2_P0                        *((volatile  uint8_t *)(0x42DE8100UL))
#define bFM_GPIO_PDOR2_P1                         *((volatile  uint8_t *)(0x42DE8104UL))
#define bFM4_GPIO_PDOR2_P1                        *((volatile  uint8_t *)(0x42DE8104UL))
#define bFM_GPIO_PDOR2_P2                         *((volatile  uint8_t *)(0x42DE8108UL))
#define bFM4_GPIO_PDOR2_P2                        *((volatile  uint8_t *)(0x42DE8108UL))
#define bFM_GPIO_PDOR2_P3                         *((volatile  uint8_t *)(0x42DE810CUL))
#define bFM4_GPIO_PDOR2_P3                        *((volatile  uint8_t *)(0x42DE810CUL))
#define bFM_GPIO_PDOR2_P4                         *((volatile  uint8_t *)(0x42DE8110UL))
#define bFM4_GPIO_PDOR2_P4                        *((volatile  uint8_t *)(0x42DE8110UL))
#define bFM_GPIO_PDOR2_P5                         *((volatile  uint8_t *)(0x42DE8114UL))
#define bFM4_GPIO_PDOR2_P5                        *((volatile  uint8_t *)(0x42DE8114UL))
#define bFM_GPIO_PDOR2_P6                         *((volatile  uint8_t *)(0x42DE8118UL))
#define bFM4_GPIO_PDOR2_P6                        *((volatile  uint8_t *)(0x42DE8118UL))
#define bFM_GPIO_PDOR2_P7                         *((volatile  uint8_t *)(0x42DE811CUL))
#define bFM4_GPIO_PDOR2_P7                        *((volatile  uint8_t *)(0x42DE811CUL))

#define bFM_GPIO_PDOR3_P3                         *((volatile  uint8_t *)(0x42DE818CUL))
#define bFM4_GPIO_PDOR3_P3                        *((volatile  uint8_t *)(0x42DE818CUL))
#define bFM_GPIO_PDOR3_P4                         *((volatile  uint8_t *)(0x42DE8190UL))
#define bFM4_GPIO_PDOR3_P4                        *((volatile  uint8_t *)(0x42DE8190UL))
#define bFM_GPIO_PDOR3_P5                         *((volatile  uint8_t *)(0x42DE8194UL))
#define bFM4_GPIO_PDOR3_P5                        *((volatile  uint8_t *)(0x42DE8194UL))
#define bFM_GPIO_PDOR3_P6                         *((volatile  uint8_t *)(0x42DE8198UL))
#define bFM4_GPIO_PDOR3_P6                        *((volatile  uint8_t *)(0x42DE8198UL))
#define bFM_GPIO_PDOR3_P7                         *((volatile  uint8_t *)(0x42DE819CUL))
#define bFM4_GPIO_PDOR3_P7                        *((volatile  uint8_t *)(0x42DE819CUL))
#define bFM_GPIO_PDOR3_P8                         *((volatile  uint8_t *)(0x42DE81A0UL))
#define bFM4_GPIO_PDOR3_P8                        *((volatile  uint8_t *)(0x42DE81A0UL))
#define bFM_GPIO_PDOR3_P9                         *((volatile  uint8_t *)(0x42DE81A4UL))
#define bFM4_GPIO_PDOR3_P9                        *((volatile  uint8_t *)(0x42DE81A4UL))
#define bFM_GPIO_PDOR3_PA                         *((volatile  uint8_t *)(0x42DE81A8UL))
#define bFM4_GPIO_PDOR3_PA                        *((volatile  uint8_t *)(0x42DE81A8UL))
#define bFM_GPIO_PDOR3_PB                         *((volatile  uint8_t *)(0x42DE81ACUL))
#define bFM4_GPIO_PDOR3_PB                        *((volatile  uint8_t *)(0x42DE81ACUL))
#define bFM_GPIO_PDOR3_PC                         *((volatile  uint8_t *)(0x42DE81B0UL))
#define bFM4_GPIO_PDOR3_PC                        *((volatile  uint8_t *)(0x42DE81B0UL))
#define bFM_GPIO_PDOR3_PD                         *((volatile  uint8_t *)(0x42DE81B4UL))
#define bFM4_GPIO_PDOR3_PD                        *((volatile  uint8_t *)(0x42DE81B4UL))
#define bFM_GPIO_PDOR3_PE                         *((volatile  uint8_t *)(0x42DE81B8UL))
#define bFM4_GPIO_PDOR3_PE                        *((volatile  uint8_t *)(0x42DE81B8UL))
#define bFM_GPIO_PDOR3_PF                         *((volatile  uint8_t *)(0x42DE81BCUL))
#define bFM4_GPIO_PDOR3_PF                        *((volatile  uint8_t *)(0x42DE81BCUL))

