mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dfxg/common/s6e2dfxg.h
#define bFM_INTREQ_EXC02MON_NMI                   *((volatile  uint8_t *)(0x42624000UL))
#define bFM4_INTREQ_EXC02MON_NMI                  *((volatile  uint8_t *)(0x42624000UL))
#define bFM_INTREQ_EXC02MON_HWINT                 *((volatile  uint8_t *)(0x42624004UL))
#define bFM4_INTREQ_EXC02MON_HWINT                *((volatile  uint8_t *)(0x42624004UL))

#define bFM_INTREQ_IRQ000MON_FCSINT               *((volatile  uint8_t *)(0x42624080UL))
#define bFM4_INTREQ_IRQ000MON_FCSINT              *((volatile  uint8_t *)(0x42624080UL))

#define bFM_INTREQ_IRQ001MON_SWWDTINT             *((volatile  uint8_t *)(0x42624100UL))
#define bFM4_INTREQ_IRQ001MON_SWWDTINT            *((volatile  uint8_t *)(0x42624100UL))

#define bFM_INTREQ_IRQ002MON_LVDINT               *((volatile  uint8_t *)(0x42624180UL))
#define bFM4_INTREQ_IRQ002MON_LVDINT              *((volatile  uint8_t *)(0x42624180UL))

#define bFM_INTREQ_IRQ003MON_IRQBIT0              *((volatile  uint8_t *)(0x42624200UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT0             *((volatile  uint8_t *)(0x42624200UL))
#define bFM_INTREQ_IRQ003MON_IRQBIT1              *((volatile  uint8_t *)(0x42624204UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT1             *((volatile  uint8_t *)(0x42624204UL))
#define bFM_INTREQ_IRQ003MON_IRQBIT2              *((volatile  uint8_t *)(0x42624208UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT2             *((volatile  uint8_t *)(0x42624208UL))
#define bFM_INTREQ_IRQ003MON_IRQBIT3              *((volatile  uint8_t *)(0x4262420CUL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT3             *((volatile  uint8_t *)(0x4262420CUL))
#define bFM_INTREQ_IRQ003MON_IRQBIT4              *((volatile  uint8_t *)(0x42624210UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT4             *((volatile  uint8_t *)(0x42624210UL))
#define bFM_INTREQ_IRQ003MON_IRQBIT5              *((volatile  uint8_t *)(0x42624214UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT5             *((volatile  uint8_t *)(0x42624214UL))
#define bFM_INTREQ_IRQ003MON_IRQBIT6              *((volatile  uint8_t *)(0x42624218UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT6             *((volatile  uint8_t *)(0x42624218UL))
#define bFM_INTREQ_IRQ003MON_IRQBIT7              *((volatile  uint8_t *)(0x4262421CUL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT7             *((volatile  uint8_t *)(0x4262421CUL))

#define bFM_INTREQ_IRQ003SEL_SELBIT0              *((volatile  uint8_t *)(0x42622240UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT0             *((volatile  uint8_t *)(0x42622240UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT1              *((volatile  uint8_t *)(0x42622244UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT1             *((volatile  uint8_t *)(0x42622244UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT2              *((volatile  uint8_t *)(0x42622248UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT2             *((volatile  uint8_t *)(0x42622248UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT3              *((volatile  uint8_t *)(0x4262224CUL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT3             *((volatile  uint8_t *)(0x4262224CUL))
#define bFM_INTREQ_IRQ003SEL_SELBIT4              *((volatile  uint8_t *)(0x42622250UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT4             *((volatile  uint8_t *)(0x42622250UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT5              *((volatile  uint8_t *)(0x42622254UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT5             *((volatile  uint8_t *)(0x42622254UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT6              *((volatile  uint8_t *)(0x42622258UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT6             *((volatile  uint8_t *)(0x42622258UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT7              *((volatile  uint8_t *)(0x4262225CUL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT7             *((volatile  uint8_t *)(0x4262225CUL))
#define bFM_INTREQ_IRQ003SEL_SELBIT8              *((volatile  uint8_t *)(0x42622260UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT8             *((volatile  uint8_t *)(0x42622260UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT9              *((volatile  uint8_t *)(0x42622264UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT9             *((volatile  uint8_t *)(0x42622264UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT10             *((volatile  uint8_t *)(0x42622268UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT10            *((volatile  uint8_t *)(0x42622268UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT11             *((volatile  uint8_t *)(0x4262226CUL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT11            *((volatile  uint8_t *)(0x4262226CUL))
#define bFM_INTREQ_IRQ003SEL_SELBIT12             *((volatile  uint8_t *)(0x42622270UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT12            *((volatile  uint8_t *)(0x42622270UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT13             *((volatile  uint8_t *)(0x42622274UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT13            *((volatile  uint8_t *)(0x42622274UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT14             *((volatile  uint8_t *)(0x42622278UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT14            *((volatile  uint8_t *)(0x42622278UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT15             *((volatile  uint8_t *)(0x4262227CUL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT15            *((volatile  uint8_t *)(0x4262227CUL))

#define bFM_INTREQ_IRQ004MON_IRQBIT0              *((volatile  uint8_t *)(0x42624280UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT0             *((volatile  uint8_t *)(0x42624280UL))
#define bFM_INTREQ_IRQ004MON_IRQBIT1              *((volatile  uint8_t *)(0x42624284UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT1             *((volatile  uint8_t *)(0x42624284UL))
#define bFM_INTREQ_IRQ004MON_IRQBIT2              *((volatile  uint8_t *)(0x42624288UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT2             *((volatile  uint8_t *)(0x42624288UL))
#define bFM_INTREQ_IRQ004MON_IRQBIT3              *((volatile  uint8_t *)(0x4262428CUL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT3             *((volatile  uint8_t *)(0x4262428CUL))
#define bFM_INTREQ_IRQ004MON_IRQBIT4              *((volatile  uint8_t *)(0x42624290UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT4             *((volatile  uint8_t *)(0x42624290UL))
#define bFM_INTREQ_IRQ004MON_IRQBIT5              *((volatile  uint8_t *)(0x42624294UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT5             *((volatile  uint8_t *)(0x42624294UL))
#define bFM_INTREQ_IRQ004MON_IRQBIT6              *((volatile  uint8_t *)(0x42624298UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT6             *((volatile  uint8_t *)(0x42624298UL))
#define bFM_INTREQ_IRQ004MON_IRQBIT7              *((volatile  uint8_t *)(0x4262429CUL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT7             *((volatile  uint8_t *)(0x4262429CUL))

#define bFM_INTREQ_IRQ004SEL_SELBIT0              *((volatile  uint8_t *)(0x426222C0UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT0             *((volatile  uint8_t *)(0x426222C0UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT1              *((volatile  uint8_t *)(0x426222C4UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT1             *((volatile  uint8_t *)(0x426222C4UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT2              *((volatile  uint8_t *)(0x426222C8UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT2             *((volatile  uint8_t *)(0x426222C8UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT3              *((volatile  uint8_t *)(0x426222CCUL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT3             *((volatile  uint8_t *)(0x426222CCUL))
#define bFM_INTREQ_IRQ004SEL_SELBIT4              *((volatile  uint8_t *)(0x426222D0UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT4             *((volatile  uint8_t *)(0x426222D0UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT5              *((volatile  uint8_t *)(0x426222D4UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT5             *((volatile  uint8_t *)(0x426222D4UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT6              *((volatile  uint8_t *)(0x426222D8UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT6             *((volatile  uint8_t *)(0x426222D8UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT7              *((volatile  uint8_t *)(0x426222DCUL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT7             *((volatile  uint8_t *)(0x426222DCUL))
#define bFM_INTREQ_IRQ004SEL_SELBIT8              *((volatile  uint8_t *)(0x426222E0UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT8             *((volatile  uint8_t *)(0x426222E0UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT9              *((volatile  uint8_t *)(0x426222E4UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT9             *((volatile  uint8_t *)(0x426222E4UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT10             *((volatile  uint8_t *)(0x426222E8UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT10            *((volatile  uint8_t *)(0x426222E8UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT11             *((volatile  uint8_t *)(0x426222ECUL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT11            *((volatile  uint8_t *)(0x426222ECUL))
#define bFM_INTREQ_IRQ004SEL_SELBIT12             *((volatile  uint8_t *)(0x426222F0UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT12            *((volatile  uint8_t *)(0x426222F0UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT13             *((volatile  uint8_t *)(0x426222F4UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT13            *((volatile  uint8_t *)(0x426222F4UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT14             *((volatile  uint8_t *)(0x426222F8UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT14            *((volatile  uint8_t *)(0x426222F8UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT15             *((volatile  uint8_t *)(0x426222FCUL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT15            *((volatile  uint8_t *)(0x426222FCUL))

